GopalSaraf/Practicals/PSDL/include/proc/pic16f18124.h
// Register: CCP2CAP
#define CCP2CAP CCP2CAP
extern volatile unsigned char           CCP2CAP             __at(0x413);
#ifndef _LIB_BUILD
asm("CCP2CAP equ 0413h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :6;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
    };
    struct {
        unsigned CCP2CTS                :6;
    };
    struct {
        unsigned CCP2CTS0               :1;
        unsigned CCP2CTS1               :1;
        unsigned CCP2CTS2               :1;
        unsigned CCP2CTS3               :1;
    };
} CCP2CAPbits_t;
extern volatile CCP2CAPbits_t CCP2CAPbits __at(0x413);
// bitfield macros
#define _CCP2CAP_CTS_POSN                                   0x0
#define _CCP2CAP_CTS_POSITION                               0x0
#define _CCP2CAP_CTS_SIZE                                   0x6
#define _CCP2CAP_CTS_LENGTH                                 0x6
#define _CCP2CAP_CTS_MASK                                   0x3F
#define _CCP2CAP_CTS0_POSN                                  0x0
#define _CCP2CAP_CTS0_POSITION                              0x0
#define _CCP2CAP_CTS0_SIZE                                  0x1
#define _CCP2CAP_CTS0_LENGTH                                0x1
#define _CCP2CAP_CTS0_MASK                                  0x1
#define _CCP2CAP_CTS1_POSN                                  0x1
#define _CCP2CAP_CTS1_POSITION                              0x1
#define _CCP2CAP_CTS1_SIZE                                  0x1
#define _CCP2CAP_CTS1_LENGTH                                0x1
#define _CCP2CAP_CTS1_MASK                                  0x2
#define _CCP2CAP_CTS2_POSN                                  0x2
#define _CCP2CAP_CTS2_POSITION                              0x2
#define _CCP2CAP_CTS2_SIZE                                  0x1
#define _CCP2CAP_CTS2_LENGTH                                0x1
#define _CCP2CAP_CTS2_MASK                                  0x4
#define _CCP2CAP_CTS3_POSN                                  0x3
#define _CCP2CAP_CTS3_POSITION                              0x3
#define _CCP2CAP_CTS3_SIZE                                  0x1
#define _CCP2CAP_CTS3_LENGTH                                0x1
#define _CCP2CAP_CTS3_MASK                                  0x8
#define _CCP2CAP_CCP2CTS_POSN                               0x0
#define _CCP2CAP_CCP2CTS_POSITION                           0x0
#define _CCP2CAP_CCP2CTS_SIZE                               0x6
#define _CCP2CAP_CCP2CTS_LENGTH                             0x6
#define _CCP2CAP_CCP2CTS_MASK                               0x3F
#define _CCP2CAP_CCP2CTS0_POSN                              0x0
#define _CCP2CAP_CCP2CTS0_POSITION                          0x0
#define _CCP2CAP_CCP2CTS0_SIZE                              0x1
#define _CCP2CAP_CCP2CTS0_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS0_MASK                              0x1
#define _CCP2CAP_CCP2CTS1_POSN                              0x1
#define _CCP2CAP_CCP2CTS1_POSITION                          0x1
#define _CCP2CAP_CCP2CTS1_SIZE                              0x1
#define _CCP2CAP_CCP2CTS1_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS1_MASK                              0x2
#define _CCP2CAP_CCP2CTS2_POSN                              0x2
#define _CCP2CAP_CCP2CTS2_POSITION                          0x2
#define _CCP2CAP_CCP2CTS2_SIZE                              0x1
#define _CCP2CAP_CCP2CTS2_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS2_MASK                              0x4
#define _CCP2CAP_CCP2CTS3_POSN                              0x3
#define _CCP2CAP_CCP2CTS3_POSITION                          0x3
#define _CCP2CAP_CCP2CTS3_SIZE                              0x1
#define _CCP2CAP_CCP2CTS3_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS3_MASK                              0x8

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
extern volatile unsigned char           CCPTMRS0            __at(0x41F);
#ifndef _LIB_BUILD
asm("CCPTMRS0 equ 041Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1TSEL                 :2;
        unsigned C2TSEL                 :2;
    };
} CCPTMRS0bits_t;
extern volatile CCPTMRS0bits_t CCPTMRS0bits __at(0x41F);
// bitfield macros
#define _CCPTMRS0_C1TSEL_POSN                               0x0
#define _CCPTMRS0_C1TSEL_POSITION                           0x0
#define _CCPTMRS0_C1TSEL_SIZE                               0x2
#define _CCPTMRS0_C1TSEL_LENGTH                             0x2
#define _CCPTMRS0_C1TSEL_MASK                               0x3
#define _CCPTMRS0_C2TSEL_POSN                               0x2
#define _CCPTMRS0_C2TSEL_POSITION                           0x2
#define _CCPTMRS0_C2TSEL_SIZE                               0x2
#define _CCPTMRS0_C2TSEL_LENGTH                             0x2
#define _CCPTMRS0_C2TSEL_MASK                               0xC

// Register: PWM1ERS
#define PWM1ERS PWM1ERS
extern volatile unsigned char           PWM1ERS             __at(0x48C);
#ifndef _LIB_BUILD
asm("PWM1ERS equ 048Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
    };
} PWM1ERSbits_t;
extern volatile PWM1ERSbits_t PWM1ERSbits __at(0x48C);
// bitfield macros
#define _PWM1ERS_ERS_POSN                                   0x0
#define _PWM1ERS_ERS_POSITION                               0x0
#define _PWM1ERS_ERS_SIZE                                   0x8
#define _PWM1ERS_ERS_LENGTH                                 0x8
#define _PWM1ERS_ERS_MASK                                   0xFF
#define _PWM1ERS_ERS0_POSN                                  0x0
#define _PWM1ERS_ERS0_POSITION                              0x0
#define _PWM1ERS_ERS0_SIZE                                  0x1
#define _PWM1ERS_ERS0_LENGTH                                0x1
#define _PWM1ERS_ERS0_MASK                                  0x1
#define _PWM1ERS_ERS1_POSN                                  0x1
#define _PWM1ERS_ERS1_POSITION                              0x1
#define _PWM1ERS_ERS1_SIZE                                  0x1
#define _PWM1ERS_ERS1_LENGTH                                0x1
#define _PWM1ERS_ERS1_MASK                                  0x2
#define _PWM1ERS_ERS2_POSN                                  0x2
#define _PWM1ERS_ERS2_POSITION                              0x2
#define _PWM1ERS_ERS2_SIZE                                  0x1
#define _PWM1ERS_ERS2_LENGTH                                0x1
#define _PWM1ERS_ERS2_MASK                                  0x4
#define _PWM1ERS_ERS3_POSN                                  0x3
#define _PWM1ERS_ERS3_POSITION                              0x3
#define _PWM1ERS_ERS3_SIZE                                  0x1
#define _PWM1ERS_ERS3_LENGTH                                0x1
#define _PWM1ERS_ERS3_MASK                                  0x8

// Register: PWM1CLK
#define PWM1CLK PWM1CLK
extern volatile unsigned char           PWM1CLK             __at(0x48D);
#ifndef _LIB_BUILD
asm("PWM1CLK equ 048Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} PWM1CLKbits_t;
extern volatile PWM1CLKbits_t PWM1CLKbits __at(0x48D);
// bitfield macros
#define _PWM1CLK_CLK_POSN                                   0x0
#define _PWM1CLK_CLK_POSITION                               0x0
#define _PWM1CLK_CLK_SIZE                                   0x8
#define _PWM1CLK_CLK_LENGTH                                 0x8
#define _PWM1CLK_CLK_MASK                                   0xFF
#define _PWM1CLK_CLK0_POSN                                  0x0
#define _PWM1CLK_CLK0_POSITION                              0x0
#define _PWM1CLK_CLK0_SIZE                                  0x1
#define _PWM1CLK_CLK0_LENGTH                                0x1
#define _PWM1CLK_CLK0_MASK                                  0x1
#define _PWM1CLK_CLK1_POSN                                  0x1
#define _PWM1CLK_CLK1_POSITION                              0x1
#define _PWM1CLK_CLK1_SIZE                                  0x1
#define _PWM1CLK_CLK1_LENGTH                                0x1
#define _PWM1CLK_CLK1_MASK                                  0x2
#define _PWM1CLK_CLK2_POSN                                  0x2
#define _PWM1CLK_CLK2_POSITION                              0x2
#define _PWM1CLK_CLK2_SIZE                                  0x1
#define _PWM1CLK_CLK2_LENGTH                                0x1
#define _PWM1CLK_CLK2_MASK                                  0x4
#define _PWM1CLK_CLK3_POSN                                  0x3
#define _PWM1CLK_CLK3_POSITION                              0x3
#define _PWM1CLK_CLK3_SIZE                                  0x1
#define _PWM1CLK_CLK3_LENGTH                                0x1
#define _PWM1CLK_CLK3_MASK                                  0x8

// Register: PWM1LDS
#define PWM1LDS PWM1LDS
extern volatile unsigned char           PWM1LDS             __at(0x48E);
#ifndef _LIB_BUILD
asm("PWM1LDS equ 048Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
    };
} PWM1LDSbits_t;
extern volatile PWM1LDSbits_t PWM1LDSbits __at(0x48E);
// bitfield macros
#define _PWM1LDS_LDS_POSN                                   0x0
#define _PWM1LDS_LDS_POSITION                               0x0
#define _PWM1LDS_LDS_SIZE                                   0x8
#define _PWM1LDS_LDS_LENGTH                                 0x8
#define _PWM1LDS_LDS_MASK                                   0xFF
#define _PWM1LDS_LDS0_POSN                                  0x0
#define _PWM1LDS_LDS0_POSITION                              0x0
#define _PWM1LDS_LDS0_SIZE                                  0x1
#define _PWM1LDS_LDS0_LENGTH                                0x1
#define _PWM1LDS_LDS0_MASK                                  0x1
#define _PWM1LDS_LDS1_POSN                                  0x1
#define _PWM1LDS_LDS1_POSITION                              0x1
#define _PWM1LDS_LDS1_SIZE                                  0x1
#define _PWM1LDS_LDS1_LENGTH                                0x1
#define _PWM1LDS_LDS1_MASK                                  0x2
#define _PWM1LDS_LDS2_POSN                                  0x2
#define _PWM1LDS_LDS2_POSITION                              0x2
#define _PWM1LDS_LDS2_SIZE                                  0x1
#define _PWM1LDS_LDS2_LENGTH                                0x1
#define _PWM1LDS_LDS2_MASK                                  0x4

// Register: PWM1PR
#define PWM1PR PWM1PR
extern volatile unsigned short          PWM1PR              __at(0x48F);
#ifndef _LIB_BUILD
asm("PWM1PR equ 048Fh");
#endif

// Register: PWM1PRL
#define PWM1PRL PWM1PRL
extern volatile unsigned char           PWM1PRL             __at(0x48F);
#ifndef _LIB_BUILD
asm("PWM1PRL equ 048Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
} PWM1PRLbits_t;
extern volatile PWM1PRLbits_t PWM1PRLbits __at(0x48F);
// bitfield macros
#define _PWM1PRL_PRL_POSN                                   0x0
#define _PWM1PRL_PRL_POSITION                               0x0
#define _PWM1PRL_PRL_SIZE                                   0x8
#define _PWM1PRL_PRL_LENGTH                                 0x8
#define _PWM1PRL_PRL_MASK                                   0xFF

// Register: PWM1PRH
#define PWM1PRH PWM1PRH
extern volatile unsigned char           PWM1PRH             __at(0x490);
#ifndef _LIB_BUILD
asm("PWM1PRH equ 0490h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
} PWM1PRHbits_t;
extern volatile PWM1PRHbits_t PWM1PRHbits __at(0x490);
// bitfield macros
#define _PWM1PRH_PRH_POSN                                   0x0
#define _PWM1PRH_PRH_POSITION                               0x0
#define _PWM1PRH_PRH_SIZE                                   0x8
#define _PWM1PRH_PRH_LENGTH                                 0x8
#define _PWM1PRH_PRH_MASK                                   0xFF

// Register: PWM1CPRE
#define PWM1CPRE PWM1CPRE
extern volatile unsigned char           PWM1CPRE            __at(0x491);
#ifndef _LIB_BUILD
asm("PWM1CPRE equ 0491h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRE                   :8;
    };
} PWM1CPREbits_t;
extern volatile PWM1CPREbits_t PWM1CPREbits __at(0x491);
// bitfield macros
#define _PWM1CPRE_CPRE_POSN                                 0x0
#define _PWM1CPRE_CPRE_POSITION                             0x0
#define _PWM1CPRE_CPRE_SIZE                                 0x8
#define _PWM1CPRE_CPRE_LENGTH                               0x8
#define _PWM1CPRE_CPRE_MASK                                 0xFF

// Register: PWM1PIPOS
#define PWM1PIPOS PWM1PIPOS
extern volatile unsigned char           PWM1PIPOS           __at(0x492);
#ifndef _LIB_BUILD
asm("PWM1PIPOS equ 0492h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIPOS                  :8;
    };
} PWM1PIPOSbits_t;
extern volatile PWM1PIPOSbits_t PWM1PIPOSbits __at(0x492);
// bitfield macros
#define _PWM1PIPOS_PIPOS_POSN                               0x0
#define _PWM1PIPOS_PIPOS_POSITION                           0x0
#define _PWM1PIPOS_PIPOS_SIZE                               0x8
#define _PWM1PIPOS_PIPOS_LENGTH                             0x8
#define _PWM1PIPOS_PIPOS_MASK                               0xFF

// Register: PWM1GIR
#define PWM1GIR PWM1GIR
extern volatile unsigned char           PWM1GIR             __at(0x493);
#ifndef _LIB_BUILD
asm("PWM1GIR equ 0493h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IF                 :1;
        unsigned S1P2IF                 :1;
    };
} PWM1GIRbits_t;
extern volatile PWM1GIRbits_t PWM1GIRbits __at(0x493);
// bitfield macros
#define _PWM1GIR_S1P1_POSN                                  0x0
#define _PWM1GIR_S1P1_POSITION                              0x0
#define _PWM1GIR_S1P1_SIZE                                  0x1
#define _PWM1GIR_S1P1_LENGTH                                0x1
#define _PWM1GIR_S1P1_MASK                                  0x1
#define _PWM1GIR_S1P2_POSN                                  0x1
#define _PWM1GIR_S1P2_POSITION                              0x1
#define _PWM1GIR_S1P2_SIZE                                  0x1
#define _PWM1GIR_S1P2_LENGTH                                0x1
#define _PWM1GIR_S1P2_MASK                                  0x2
#define _PWM1GIR_S1P1IF_POSN                                0x0
#define _PWM1GIR_S1P1IF_POSITION                            0x0
#define _PWM1GIR_S1P1IF_SIZE                                0x1
#define _PWM1GIR_S1P1IF_LENGTH                              0x1
#define _PWM1GIR_S1P1IF_MASK                                0x1
#define _PWM1GIR_S1P2IF_POSN                                0x1
#define _PWM1GIR_S1P2IF_POSITION                            0x1
#define _PWM1GIR_S1P2IF_SIZE                                0x1
#define _PWM1GIR_S1P2IF_LENGTH                              0x1
#define _PWM1GIR_S1P2IF_MASK                                0x2

