GopalSaraf/Practicals/PSDL/include/proc/pic16f18124.h
// Register: DAC1CON
#define DAC1CON DAC1CON
extern volatile unsigned char           DAC1CON             __at(0x88C);
#ifndef _LIB_BUILD
asm("DAC1CON equ 088Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :1;
        unsigned                        :1;
        unsigned PSS                    :2;
        unsigned OE                     :2;
        unsigned REFRNG                 :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned OE0                    :1;
        unsigned OE1                    :1;
    };
} DAC1CONbits_t;
extern volatile DAC1CONbits_t DAC1CONbits __at(0x88C);
// bitfield macros
#define _DAC1CON_NSS_POSN                                   0x0
#define _DAC1CON_NSS_POSITION                               0x0
#define _DAC1CON_NSS_SIZE                                   0x1
#define _DAC1CON_NSS_LENGTH                                 0x1
#define _DAC1CON_NSS_MASK                                   0x1
#define _DAC1CON_PSS_POSN                                   0x2
#define _DAC1CON_PSS_POSITION                               0x2
#define _DAC1CON_PSS_SIZE                                   0x2
#define _DAC1CON_PSS_LENGTH                                 0x2
#define _DAC1CON_PSS_MASK                                   0xC
#define _DAC1CON_OE_POSN                                    0x4
#define _DAC1CON_OE_POSITION                                0x4
#define _DAC1CON_OE_SIZE                                    0x2
#define _DAC1CON_OE_LENGTH                                  0x2
#define _DAC1CON_OE_MASK                                    0x30
#define _DAC1CON_REFRNG_POSN                                0x6
#define _DAC1CON_REFRNG_POSITION                            0x6
#define _DAC1CON_REFRNG_SIZE                                0x1
#define _DAC1CON_REFRNG_LENGTH                              0x1
#define _DAC1CON_REFRNG_MASK                                0x40
#define _DAC1CON_EN_POSN                                    0x7
#define _DAC1CON_EN_POSITION                                0x7
#define _DAC1CON_EN_SIZE                                    0x1
#define _DAC1CON_EN_LENGTH                                  0x1
#define _DAC1CON_EN_MASK                                    0x80
#define _DAC1CON_PSS0_POSN                                  0x2
#define _DAC1CON_PSS0_POSITION                              0x2
#define _DAC1CON_PSS0_SIZE                                  0x1
#define _DAC1CON_PSS0_LENGTH                                0x1
#define _DAC1CON_PSS0_MASK                                  0x4
#define _DAC1CON_PSS1_POSN                                  0x3
#define _DAC1CON_PSS1_POSITION                              0x3
#define _DAC1CON_PSS1_SIZE                                  0x1
#define _DAC1CON_PSS1_LENGTH                                0x1
#define _DAC1CON_PSS1_MASK                                  0x8
#define _DAC1CON_OE0_POSN                                   0x4
#define _DAC1CON_OE0_POSITION                               0x4
#define _DAC1CON_OE0_SIZE                                   0x1
#define _DAC1CON_OE0_LENGTH                                 0x1
#define _DAC1CON_OE0_MASK                                   0x10
#define _DAC1CON_OE1_POSN                                   0x5
#define _DAC1CON_OE1_POSITION                               0x5
#define _DAC1CON_OE1_SIZE                                   0x1
#define _DAC1CON_OE1_LENGTH                                 0x1
#define _DAC1CON_OE1_MASK                                   0x20

// Register: DAC1DATL
#define DAC1DATL DAC1DATL
extern volatile unsigned char           DAC1DATL            __at(0x88D);
#ifndef _LIB_BUILD
asm("DAC1DATL equ 088Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :8;
    };
    struct {
        unsigned DAT                    :8;
    };
} DAC1DATLbits_t;
extern volatile DAC1DATLbits_t DAC1DATLbits __at(0x88D);
// bitfield macros
#define _DAC1DATL_DAC1R_POSN                                0x0
#define _DAC1DATL_DAC1R_POSITION                            0x0
#define _DAC1DATL_DAC1R_SIZE                                0x8
#define _DAC1DATL_DAC1R_LENGTH                              0x8
#define _DAC1DATL_DAC1R_MASK                                0xFF
#define _DAC1DATL_DAT_POSN                                  0x0
#define _DAC1DATL_DAT_POSITION                              0x0
#define _DAC1DATL_DAT_SIZE                                  0x8
#define _DAC1DATL_DAT_LENGTH                                0x8
#define _DAC1DATL_DAT_MASK                                  0xFF

// Register: DAC2CON
#define DAC2CON DAC2CON
extern volatile unsigned char           DAC2CON             __at(0x890);
#ifndef _LIB_BUILD
asm("DAC2CON equ 0890h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :1;
        unsigned                        :1;
        unsigned PSS                    :2;
        unsigned                        :3;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
} DAC2CONbits_t;
extern volatile DAC2CONbits_t DAC2CONbits __at(0x890);
// bitfield macros
#define _DAC2CON_NSS_POSN                                   0x0
#define _DAC2CON_NSS_POSITION                               0x0
#define _DAC2CON_NSS_SIZE                                   0x1
#define _DAC2CON_NSS_LENGTH                                 0x1
#define _DAC2CON_NSS_MASK                                   0x1
#define _DAC2CON_PSS_POSN                                   0x2
#define _DAC2CON_PSS_POSITION                               0x2
#define _DAC2CON_PSS_SIZE                                   0x2
#define _DAC2CON_PSS_LENGTH                                 0x2
#define _DAC2CON_PSS_MASK                                   0xC
#define _DAC2CON_EN_POSN                                    0x7
#define _DAC2CON_EN_POSITION                                0x7
#define _DAC2CON_EN_SIZE                                    0x1
#define _DAC2CON_EN_LENGTH                                  0x1
#define _DAC2CON_EN_MASK                                    0x80
#define _DAC2CON_PSS0_POSN                                  0x2
#define _DAC2CON_PSS0_POSITION                              0x2
#define _DAC2CON_PSS0_SIZE                                  0x1
#define _DAC2CON_PSS0_LENGTH                                0x1
#define _DAC2CON_PSS0_MASK                                  0x4
#define _DAC2CON_PSS1_POSN                                  0x3
#define _DAC2CON_PSS1_POSITION                              0x3
#define _DAC2CON_PSS1_SIZE                                  0x1
#define _DAC2CON_PSS1_LENGTH                                0x1
#define _DAC2CON_PSS1_MASK                                  0x8

