GopalSaraf/Practicals/PSDL/include/proc/pic16f18124.h
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// PIE1<SCANIE>
extern volatile __bit                   SCANIE              __at(0x4BA);	// @ (0x97 * 8 + 2)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<SCANIF>
extern volatile __bit                   SCANIF              __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR1,2)
// PMD0<SCANMD>
extern volatile __bit                   SCANMD              __at(0x862);	// @ (0x10C * 8 + 2)
#define                                 SCANMD_bit          _BIT_ACCESS(PMD0,2)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0x3C88);	// @ (0x791 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// SSP2CON2<SEN2>
extern volatile __bit                   SEN2                __at(0x3CD8);	// @ (0x79B * 8 + 0)
#define                                 SEN2_bit            _BIT_ACCESS(SSP2CON2,0)
// CRCCON0<SETUP0>
extern volatile __bit                   SETUP0              __at(0xE512);	// @ (0x1CA2 * 8 + 2)
#define                                 SETUP0_bit          _BIT_ACCESS(CRCCON0,2)
// CRCCON0<SETUP1>
extern volatile __bit                   SETUP1              __at(0xE513);	// @ (0x1CA2 * 8 + 3)
#define                                 SETUP1_bit          _BIT_ACCESS(CRCCON0,3)
// OSCSTAT<SFOR>
extern volatile __bit                   SFOR                __at(0x1481);	// @ (0x290 * 8 + 1)
#define                                 SFOR_bit            _BIT_ACCESS(OSCSTAT,1)
// SCANCON0<SGO>
extern volatile __bit                   SGO                 __at(0xE4C6);	// @ (0x1C98 * 8 + 6)
#define                                 SGO_bit             _BIT_ACCESS(SCANCON0,6)
// CRCSHFTL<SHIFT0>
extern volatile __bit                   SHIFT0              __at(0xE4F0);	// @ (0x1C9E * 8 + 0)
#define                                 SHIFT0_bit          _BIT_ACCESS(CRCSHFTL,0)
// CRCSHFTL<SHIFT1>
extern volatile __bit                   SHIFT1              __at(0xE4F1);	// @ (0x1C9E * 8 + 1)
#define                                 SHIFT1_bit          _BIT_ACCESS(CRCSHFTL,1)
// CRCSHFTH<SHIFT10>
extern volatile __bit                   SHIFT10             __at(0xE4FA);	// @ (0x1C9F * 8 + 2)
#define                                 SHIFT10_bit         _BIT_ACCESS(CRCSHFTH,2)
// CRCSHFTH<SHIFT11>
extern volatile __bit                   SHIFT11             __at(0xE4FB);	// @ (0x1C9F * 8 + 3)
#define                                 SHIFT11_bit         _BIT_ACCESS(CRCSHFTH,3)
// CRCSHFTH<SHIFT12>
extern volatile __bit                   SHIFT12             __at(0xE4FC);	// @ (0x1C9F * 8 + 4)
#define                                 SHIFT12_bit         _BIT_ACCESS(CRCSHFTH,4)
// CRCSHFTH<SHIFT13>
extern volatile __bit                   SHIFT13             __at(0xE4FD);	// @ (0x1C9F * 8 + 5)
#define                                 SHIFT13_bit         _BIT_ACCESS(CRCSHFTH,5)
// CRCSHFTH<SHIFT14>
extern volatile __bit                   SHIFT14             __at(0xE4FE);	// @ (0x1C9F * 8 + 6)
#define                                 SHIFT14_bit         _BIT_ACCESS(CRCSHFTH,6)
// CRCSHFTH<SHIFT15>
extern volatile __bit                   SHIFT15             __at(0xE4FF);	// @ (0x1C9F * 8 + 7)
#define                                 SHIFT15_bit         _BIT_ACCESS(CRCSHFTH,7)
// CRCSHFTU<SHIFT16>
extern volatile __bit                   SHIFT16             __at(0xE500);	// @ (0x1CA0 * 8 + 0)
#define                                 SHIFT16_bit         _BIT_ACCESS(CRCSHFTU,0)
// CRCSHFTU<SHIFT17>
extern volatile __bit                   SHIFT17             __at(0xE501);	// @ (0x1CA0 * 8 + 1)
#define                                 SHIFT17_bit         _BIT_ACCESS(CRCSHFTU,1)
// CRCSHFTU<SHIFT18>
extern volatile __bit                   SHIFT18             __at(0xE502);	// @ (0x1CA0 * 8 + 2)
#define                                 SHIFT18_bit         _BIT_ACCESS(CRCSHFTU,2)
// CRCSHFTU<SHIFT19>
extern volatile __bit                   SHIFT19             __at(0xE503);	// @ (0x1CA0 * 8 + 3)
#define                                 SHIFT19_bit         _BIT_ACCESS(CRCSHFTU,3)
// CRCSHFTL<SHIFT2>
extern volatile __bit                   SHIFT2              __at(0xE4F2);	// @ (0x1C9E * 8 + 2)
#define                                 SHIFT2_bit          _BIT_ACCESS(CRCSHFTL,2)
// CRCSHFTU<SHIFT20>
extern volatile __bit                   SHIFT20             __at(0xE504);	// @ (0x1CA0 * 8 + 4)
#define                                 SHIFT20_bit         _BIT_ACCESS(CRCSHFTU,4)
// CRCSHFTU<SHIFT21>
extern volatile __bit                   SHIFT21             __at(0xE505);	// @ (0x1CA0 * 8 + 5)
#define                                 SHIFT21_bit         _BIT_ACCESS(CRCSHFTU,5)
// CRCSHFTU<SHIFT22>
extern volatile __bit                   SHIFT22             __at(0xE506);	// @ (0x1CA0 * 8 + 6)
#define                                 SHIFT22_bit         _BIT_ACCESS(CRCSHFTU,6)
// CRCSHFTU<SHIFT23>
extern volatile __bit                   SHIFT23             __at(0xE507);	// @ (0x1CA0 * 8 + 7)
#define                                 SHIFT23_bit         _BIT_ACCESS(CRCSHFTU,7)
// CRCSHFTT<SHIFT24>
extern volatile __bit                   SHIFT24             __at(0xE508);	// @ (0x1CA1 * 8 + 0)
#define                                 SHIFT24_bit         _BIT_ACCESS(CRCSHFTT,0)
// CRCSHFTT<SHIFT25>
extern volatile __bit                   SHIFT25             __at(0xE509);	// @ (0x1CA1 * 8 + 1)
#define                                 SHIFT25_bit         _BIT_ACCESS(CRCSHFTT,1)
// CRCSHFTT<SHIFT26>
extern volatile __bit                   SHIFT26             __at(0xE50A);	// @ (0x1CA1 * 8 + 2)
#define                                 SHIFT26_bit         _BIT_ACCESS(CRCSHFTT,2)
// CRCSHFTT<SHIFT27>
extern volatile __bit                   SHIFT27             __at(0xE50B);	// @ (0x1CA1 * 8 + 3)
#define                                 SHIFT27_bit         _BIT_ACCESS(CRCSHFTT,3)
// CRCSHFTT<SHIFT28>
extern volatile __bit                   SHIFT28             __at(0xE50C);	// @ (0x1CA1 * 8 + 4)
#define                                 SHIFT28_bit         _BIT_ACCESS(CRCSHFTT,4)
// CRCSHFTT<SHIFT29>
extern volatile __bit                   SHIFT29             __at(0xE50D);	// @ (0x1CA1 * 8 + 5)
#define                                 SHIFT29_bit         _BIT_ACCESS(CRCSHFTT,5)
// CRCSHFTL<SHIFT3>
extern volatile __bit                   SHIFT3              __at(0xE4F3);	// @ (0x1C9E * 8 + 3)
#define                                 SHIFT3_bit          _BIT_ACCESS(CRCSHFTL,3)
// CRCSHFTT<SHIFT30>
extern volatile __bit                   SHIFT30             __at(0xE50E);	// @ (0x1CA1 * 8 + 6)
#define                                 SHIFT30_bit         _BIT_ACCESS(CRCSHFTT,6)
// CRCSHFTT<SHIFT31>
extern volatile __bit                   SHIFT31             __at(0xE50F);	// @ (0x1CA1 * 8 + 7)
#define                                 SHIFT31_bit         _BIT_ACCESS(CRCSHFTT,7)
// CRCSHFTL<SHIFT4>
extern volatile __bit                   SHIFT4              __at(0xE4F4);	// @ (0x1C9E * 8 + 4)
#define                                 SHIFT4_bit          _BIT_ACCESS(CRCSHFTL,4)
// CRCSHFTL<SHIFT5>
extern volatile __bit                   SHIFT5              __at(0xE4F5);	// @ (0x1C9E * 8 + 5)
#define                                 SHIFT5_bit          _BIT_ACCESS(CRCSHFTL,5)
// CRCSHFTL<SHIFT6>
extern volatile __bit                   SHIFT6              __at(0xE4F6);	// @ (0x1C9E * 8 + 6)
#define                                 SHIFT6_bit          _BIT_ACCESS(CRCSHFTL,6)
// CRCSHFTL<SHIFT7>
extern volatile __bit                   SHIFT7              __at(0xE4F7);	// @ (0x1C9E * 8 + 7)
#define                                 SHIFT7_bit          _BIT_ACCESS(CRCSHFTL,7)
// CRCSHFTH<SHIFT8>
extern volatile __bit                   SHIFT8              __at(0xE4F8);	// @ (0x1C9F * 8 + 0)
#define                                 SHIFT8_bit          _BIT_ACCESS(CRCSHFTH,0)
// CRCSHFTH<SHIFT9>
extern volatile __bit                   SHIFT9              __at(0xE4F9);	// @ (0x1C9F * 8 + 1)
#define                                 SHIFT9_bit          _BIT_ACCESS(CRCSHFTH,1)
// CRCCON0<SHIFTM>
extern volatile __bit                   SHIFTM              __at(0xE511);	// @ (0x1CA2 * 8 + 1)
#define                                 SHIFTM_bit          _BIT_ACCESS(CRCCON0,1)
// CWG1AS0<SHUTDOWN>
extern volatile __bit                   SHUTDOWN            __at(0x3097);	// @ (0x612 * 8 + 7)
#define                                 SHUTDOWN_bit        _BIT_ACCESS(CWG1AS0,7)
// CLCSELECT<SLCT0>
extern volatile __bit                   SLCT0               __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 SLCT0_bit           _BIT_ACCESS(CLCSELECT,0)
// CLCSELECT<SLCT1>
extern volatile __bit                   SLCT1               __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 SLCT1_bit           _BIT_ACCESS(CLCSELECT,1)
// CLCSELECT<SLCT2>
extern volatile __bit                   SLCT2               __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 SLCT2_bit           _BIT_ACCESS(CLCSELECT,2)
// CLCSELECT<SLCT3>
extern volatile __bit                   SLCT3               __at(0x34B3);	// @ (0x696 * 8 + 3)
#define                                 SLCT3_bit           _BIT_ACCESS(CLCSELECT,3)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0xF478);	// @ (0x1E8F * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0xF479);	// @ (0x1E8F * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0xF47A);	// @ (0x1E8F * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0xF47B);	// @ (0x1E8F * 8 + 3)
#define                                 SLRA3_bit           _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0xF47C);	// @ (0x1E8F * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0xF47D);	// @ (0x1E8F * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0xF518);	// @ (0x1EA3 * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0xF519);	// @ (0x1EA3 * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0xF51A);	// @ (0x1EA3 * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0xF51B);	// @ (0x1EA3 * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0xF51C);	// @ (0x1EA3 * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0xF51D);	// @ (0x1EA3 * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0x3C7F);	// @ (0x78F * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0x3CCF);	// @ (0x799 * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// ADCON3<SOI>
extern volatile __bit                   SOI                 __at(0xE94B);	// @ (0x1D29 * 8 + 3)
#define                                 SOI_bit             _BIT_ACCESS(ADCON3,3)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x1483);	// @ (0x290 * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x148B);	// @ (0x291 * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x147E);	// @ (0x28F * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// SSP1CLKPPS<SSP1CLKPPS0>
extern volatile __bit                   SSP1CLKPPS0         __at(0xF238);	// @ (0x1E47 * 8 + 0)
#define                                 SSP1CLKPPS0_bit     _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSP1CLKPPS1>
extern volatile __bit                   SSP1CLKPPS1         __at(0xF239);	// @ (0x1E47 * 8 + 1)
#define                                 SSP1CLKPPS1_bit     _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSP1CLKPPS2>
extern volatile __bit                   SSP1CLKPPS2         __at(0xF23A);	// @ (0x1E47 * 8 + 2)
#define                                 SSP1CLKPPS2_bit     _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSP1CLKPPS3>
extern volatile __bit                   SSP1CLKPPS3         __at(0xF23B);	// @ (0x1E47 * 8 + 3)
#define                                 SSP1CLKPPS3_bit     _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSP1CLKPPS4>
extern volatile __bit                   SSP1CLKPPS4         __at(0xF23C);	// @ (0x1E47 * 8 + 4)
#define                                 SSP1CLKPPS4_bit     _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1CLKPPS<SSP1CLKPPS5>
extern volatile __bit                   SSP1CLKPPS5         __at(0xF23D);	// @ (0x1E47 * 8 + 5)
#define                                 SSP1CLKPPS5_bit     _BIT_ACCESS(SSP1CLKPPS,5)
// SSP1DATPPS<SSP1DATPPS0>
extern volatile __bit                   SSP1DATPPS0         __at(0xF240);	// @ (0x1E48 * 8 + 0)
#define                                 SSP1DATPPS0_bit     _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSP1DATPPS1>
extern volatile __bit                   SSP1DATPPS1         __at(0xF241);	// @ (0x1E48 * 8 + 1)
#define                                 SSP1DATPPS1_bit     _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSP1DATPPS2>
extern volatile __bit                   SSP1DATPPS2         __at(0xF242);	// @ (0x1E48 * 8 + 2)
#define                                 SSP1DATPPS2_bit     _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSP1DATPPS3>
extern volatile __bit                   SSP1DATPPS3         __at(0xF243);	// @ (0x1E48 * 8 + 3)
#define                                 SSP1DATPPS3_bit     _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSP1DATPPS4>
extern volatile __bit                   SSP1DATPPS4         __at(0xF244);	// @ (0x1E48 * 8 + 4)
#define                                 SSP1DATPPS4_bit     _BIT_ACCESS(SSP1DATPPS,4)
// SSP1DATPPS<SSP1DATPPS5>
extern volatile __bit                   SSP1DATPPS5         __at(0xF245);	// @ (0x1E48 * 8 + 5)
#define                                 SSP1DATPPS5_bit     _BIT_ACCESS(SSP1DATPPS,5)
// PIE5<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x4DA);	// @ (0x9B * 8 + 2)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE5,2)
// PIR5<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR5,2)
// SSP1SSPPS<SSP1SSPPS0>
extern volatile __bit                   SSP1SSPPS0          __at(0xF248);	// @ (0x1E49 * 8 + 0)
#define                                 SSP1SSPPS0_bit      _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSP1SSPPS1>
extern volatile __bit                   SSP1SSPPS1          __at(0xF249);	// @ (0x1E49 * 8 + 1)
#define                                 SSP1SSPPS1_bit      _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSP1SSPPS2>
extern volatile __bit                   SSP1SSPPS2          __at(0xF24A);	// @ (0x1E49 * 8 + 2)
#define                                 SSP1SSPPS2_bit      _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSP1SSPPS3>
extern volatile __bit                   SSP1SSPPS3          __at(0xF24B);	// @ (0x1E49 * 8 + 3)
#define                                 SSP1SSPPS3_bit      _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSP1SSPPS4>
extern volatile __bit                   SSP1SSPPS4          __at(0xF24C);	// @ (0x1E49 * 8 + 4)
#define                                 SSP1SSPPS4_bit      _BIT_ACCESS(SSP1SSPPS,4)
// SSP1SSPPS<SSP1SSPPS5>
extern volatile __bit                   SSP1SSPPS5          __at(0xF24D);	// @ (0x1E49 * 8 + 5)
#define                                 SSP1SSPPS5_bit      _BIT_ACCESS(SSP1SSPPS,5)
// PIE5<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x4DC);	// @ (0x9B * 8 + 4)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR5,4)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0x3C85);	// @ (0x790 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0x3CD5);	// @ (0x79A * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0x3C80);	// @ (0x790 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0x3C81);	// @ (0x790 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0x3C82);	// @ (0x790 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0x3C83);	// @ (0x790 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0x3C86);	// @ (0x790 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0x3CD6);	// @ (0x79A * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x3C7B);	// @ (0x78F * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0x3CCB);	// @ (0x799 * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// ADSTAT<STAT0>
extern volatile __bit                   STAT0               __at(0xE950);	// @ (0x1D2A * 8 + 0)
#define                                 STAT0_bit           _BIT_ACCESS(ADSTAT,0)
// ADSTAT<STAT1>
extern volatile __bit                   STAT1               __at(0xE951);	// @ (0x1D2A * 8 + 1)
#define                                 STAT1_bit           _BIT_ACCESS(ADSTAT,1)
// ADSTAT<STAT2>
extern volatile __bit                   STAT2               __at(0xE952);	// @ (0x1D2A * 8 + 2)
#define                                 STAT2_bit           _BIT_ACCESS(ADSTAT,2)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0xC82);	// @ (0x190 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// STATUS_SHAD<STATUS_SHAD0>
extern volatile __bit                   STATUS_SHAD0        __at(0xFF20);	// @ (0x1FE4 * 8 + 0)
#define                                 STATUS_SHAD0_bit    _BIT_ACCESS(STATUS_SHAD,0)
// STATUS_SHAD<STATUS_SHAD1>
extern volatile __bit                   STATUS_SHAD1        __at(0xFF21);	// @ (0x1FE4 * 8 + 1)
#define                                 STATUS_SHAD1_bit    _BIT_ACCESS(STATUS_SHAD,1)
// STATUS_SHAD<STATUS_SHAD2>
extern volatile __bit                   STATUS_SHAD2        __at(0xFF22);	// @ (0x1FE4 * 8 + 2)
#define                                 STATUS_SHAD2_bit    _BIT_ACCESS(STATUS_SHAD,2)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0xC97);	// @ (0x192 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0xFF68);	// @ (0x1FED * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0xFF69);	// @ (0x1FED * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0xFF6A);	// @ (0x1FED * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0xFF6B);	// @ (0x1FED * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0xFF6C);	// @ (0x1FED * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0xC96);	// @ (0x192 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0x3C7C);	// @ (0x78F * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// ADSTPTL<STPT0>
extern volatile __bit                   STPT0               __at(0xE890);	// @ (0x1D12 * 8 + 0)
#define                                 STPT0_bit           _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<STPT1>
extern volatile __bit                   STPT1               __at(0xE891);	// @ (0x1D12 * 8 + 1)
#define                                 STPT1_bit           _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<STPT10>
extern volatile __bit                   STPT10              __at(0xE89A);	// @ (0x1D13 * 8 + 2)
